src/test/resources/ws-findPartnerByName.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header />
	<S:Body>
		<ns2:findPartnerByName xmlns:ns2="http://ws.poc.boz.com/">
			<arg0>Joe</arg0>
		</ns2:findPartnerByName>
	</S:Body>
</S:Envelope>